# 백준 1110번 문제

> 출처: https://www.acmicpc.net/problem/2884

## 문제 설명

상근이는 매일 아침 알람을 듣고 일어난다. 알람을 듣고 바로 일어나면 다행이겠지만, 항상 조금만 더 자려는 마음 때문에 매일 학교를 지각하고 있다.

상근이는 모든 방법을 동원해보았지만, 조금만 더 자려는 마음은 그 어떤 것도 없앨 수가 없었다.

이런 상근이를 불쌍하게 보던, 창영이는 자신이 사용하는 방법을 추천해 주었다.

바로 "45분 일찍 알람 설정하기"이다.

이 방법은 단순하다. 원래 설정되어 있는 알람을 45분 앞서는 시간으로 바꾸는 것이다. 어차피 알람 소리를 들으면, 알람을 끄고 조금 더 잘 것이기 때문이다. 이 방법을 사용하면, 매일 아침 더 잤다는 기분을 느낄 수 있고, 학교도 지각하지 않게 된다.

현재 상근이가 설정한 알람 시각이 주어졌을 때, 창영이의 방법을 사용한다면, 이를 언제로 고쳐야 하는지 구하는 프로그램을 작성하시오.

## 문제 접근

이 문제는 분이 45 이상이거나 미만인 경우로 나누어서 계산하였다. 
분이 45이상이면 현재 시간에서 45만 빼고 계산하고 45보다 작다면 현재 시간에 -1을 한뒤 분을 계산하는 식을 생각하엿다.

## 문제 풀이 코드
```java

import java.util.*;

public class Alert {

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		
		int h = sc.nextInt(); // 시
		int m = sc.nextInt(); // 분
		
		sc.close();
		
		if(m<45) {
			h--;   // 분이 45보다 작다면 시간을 1감소
			m = 60 + (m - 45); // 분 계산
			if(h < 0) { // 자정일 경우
				h = 23;
			}
			System.out.println(h + " " + m);
		}
		else {
			System.out.println(h + " " + (m - 45));
		}
	}
}

## 문제 풀이

m이 45이상일 경우는 간단하게 m에서 45를 빼서 출력해주었고 45미만일 경우엔 h에 -1해준 뒤 m에서 45를 뺀 값을 60에 더해주었다.

그렇게하면 m이 45보다 작을 경우 45를 뺀 값이 나오게 된다.

그리고 자정을 0으로 표현하기에 알람을 자정 때 m이 45보다 작을 경우 h에 23을 대입하였다.
